pages/blog/28-Jul-2023.htm
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-28 Fri 14:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>28 Jul 2023 - Plans for the Site</title>
<meta name="description" content="In the 1990's things were crazy and you never knew what browser would be best for a site...unless they told you ;)" />
<meta name="generator" content="Org Mode" />
<link href="../../styles/main.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">28 Jul 2023 - Plans for the Site</h1>
<p>
Obviously, this site isn&rsquo;t entirely complete yet. In fact, one of the things that was quite popular to see in the ol&rsquo; dayz of the internet was &ldquo;under construction&rdquo; banners or signs on pages. I had half a mind to put one of those up, but, by the time this site was available for public consumption they would probably be gone anyway. I may still put in a page that talks about under construction signs or maybe I&rsquo;ll put up a general page discussing the landscape of the internet in its early days. For now, though that is not part of the plan.
</p>

<div id="outline-container-orgaa95f90" class="outline-2">
<h2 id="orgaa95f90">Immediate Plans</h2>
<div class="outline-text-2" id="text-orgaa95f90">
<p>
At this time I&rsquo;m looking at gathering and/or making services and sites that will work with older web browsers. The main project I would like to work on would be a matrix client that is HTML 4 compliant, but I also remember some of the things that I used to do on the web and would like to set up things like a guest book or a bulletin board system. A BBS is very complicated so I&rsquo;ll be testing some already made ones, like phpBB to see if they will work in older browsers. I may have to write my own guest book system, but that isn&rsquo;t too complicated.
</p>

<p>
Services that are not part of the site, whether I end up  building them or not will be linked under a new sections in the navigation sidebar called &ldquo;External Sites/Services&rdquo;, the guestbook and other services that are part of this site will just be linked under the local site section.
</p>
</div>
</div>
<div id="outline-container-orgae2087c" class="outline-2">
<h2 id="orgae2087c">Other Future Plans</h2>
<div class="outline-text-2" id="text-orgae2087c">
<p>
Now I&rsquo;ll talk about some of the things that may come about, but I wouldn&rsquo;t count on it just yet. One of those is a page that talks about the landscape of the internet in the 90&rsquo;s, this will be separate from the <a href="../test.htm">Test Page</a>, and will be dedicated to a discussion of practices, but common and best, of web designers and developers during the 90&rsquo;s and how that effected the user experience. I will also likely introduce some of the tools designers used to build the ol&rsquo; web. Part of this page may talk about &ldquo;under construction&rdquo; banners, but this may be dedicated to its own page depending on the amount of content. That said, I am focused on building a list of 90&rsquo;s complaint services and that comes first!
</p>
</div>
</div>
<div id="outline-container-orga01b0ba" class="outline-2">
<h2 id="orga01b0ba">Publication</h2>
<div class="outline-text-2" id="text-orga01b0ba">
<p>
At the time this was written, this site was hosted on a local intranet. At this time there is no plans to move it to the public web, however, if anyone outside of my immediate family is reading this, than that has changed. I am, however, looking at hosting this on my server, but I am not sure how I want to accomplish this at this time.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-07-28 Fri 14:04</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.6)</p>
</div>
</body>
</html>
